// TODO: реализовать

export class Logger {
  /**
   * идея такая: есть некоторый менеджер который управляет видимостью логов
   * в зависимости от его пространства имен (т.е. например чтобы скрыть логи 
   * идущие от хранилища но показать остальные). ну т.е. должны быть проверки
   * что у каждого созданного логгера уникальное пространство имен
   */
  constructor(gate, namespace) {}

  getNamespace() {}

  /**
   * доступен ли уровень логгирования для данного логгера
   */
  isActive(level) {}

  error(...args) {}

  warn(...args) {}

  info(...args) {}

  debug(...args) {}

  trace(...args) {}

  /**
   * открывает группу в консоли для группировки логов
   */
  group(label) {}

  /**
   * открывает свернутую группу в консоли для группировки логов
   */
  groupCollapsed(label) {}

  groupEnd() {}

  /**
   * печатает отформатированную таблицу в консоль
   */
  table(data, columns) {}

  /**
   * запускает таймер. метки для различимости в рамках одного логгера
   */
  time(label) {}

  /**
   * останавливает таймер и выводит результат в консоль
   * (метки должны совпадать)
   */
  timeEnd(label) {}

  /**
   * выполняет функцию и выводит в консоль ее время выполнения
   */
  timeIt(label, fn) {}
}